# YOLOv8-pose with LSNet backbone

# Parameters
nc: 1  # number of classes (person for pose)
kpt_shape: [17, 3]  # number of keypoints, number of dims (x, y, visibility)

# Model architecture
backbone:
  # LSNet backbone
  - [-1, 1, LSNetYOLOBackbone, [lsnet_t]]  # variant can be lsnet_t, lsnet_s, or lsnet_b

# YOLOv8 neck
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [256]]  # 3
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 1], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [128]]  # 6 (P3/8-small)
  
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 3], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [256]]  # 9 (P4/16-medium)
  
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 0], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [512]]  # 12 (P5/32-large)
  
  - [[6, 9, 12], 1, Pose, [nc, kpt_shape]]  # Pose head